---
kind: other
id: Properties.T:Autodesk.Revit.DB.TilePatterns
source: html/1c21624d-d9e3-399e-d41e-47753288e4f5.htm
---
# TilePatterns Properties

Identifies if the object is read-only or modifiable.